{"title":"About Rivanna","markdown":{"headingText":"About Rivanna","containsRefs":false,"markdown":"\n## Introduction\n\nA useful infrastructural resource for this course is Rivanna, UVA's high-performance computing (HPC) cluster. Each student has an account on Rivanna and access to resources there based on participation in this course. We will use Rivanna in our class for both Python and R.  \n\nThis page describes some of the tools available for your use in this course. For information about Rivanna, see this introduction. Resources for getting help, including a knowledge base and ticket system, are found at [the Support Option's Page](http://www.rc.virginia.edu/support/) on UVA's Research Computing website.\n\nYou may need to use VPN to access Rivanna from an off-grounds location. To install VPN on your computer, go to the ITS VPN page for instructions. Note that you should connect to \"UVA Anywhere,\" not to any of the higher security options.\nCourse Allocation\n\nThis course has been allocated compute and space resources on Rivanna. The names of the resources are given below. The allocation ID needs to be entered to access certain tools. The storage path is accessible to you on the remote server.\n\n* Allocation ID: `msds_ds5100`\n* Storage path: `/project/MSDS_DS5100`  (Don't use unless directed to.)\n\n## Tools \n\nUVA Research Computing provides you with a suite of tools to access Rivanna. These tools are accessible through the menu on the UVA OpenOnDemand Dashboard page. Below are some brief descriptions of the tools.\n\n**File Explorer**. A web-based GUI to access the file system of the remote server. Can be used to create, move, and delete directories and files, and to edit the contents of files (see Editor). You can also upload and download files through this interface. The File Explorer is useful to view your remote content and manage files and directories without having to use the command line. Note that not all operations can be performed through this interface.\n\nFind under \"Files\" in the menu. \n\n**Editor**. A web-based text editor launched from the File Explorer to view and edit text files on the remote server.  Although not as sophisticated as VS Code (below), this is very useful for editing data and code files without having to use a command line editor. One advantage over VS Code is that it does not need to be launched – which means it does not time out like the Interactive Apps listed below.\n\nThe Editor is launched from the File Explorer.\n\n**SSH Shell Access (Terminal)**. Access to the command line of the remote server.  Use this to open a terminal window to perform Linux commands directly.  Note that It is necessary to use a terminal to install and run certain programs on the remote server.\n\nFind under \"Clusters\" in the menu. \n\nYou can also access the remote command line via SSH on your local computer. Just enter the following on the command line of either a PC or Mac:\n\n```bash\nssh -Y <userid>@hpc.rivanna.virginia.edu\n```\n\nReplace `<userid>` with your UVA Net ID, e.g. `abc2x`. \n\nBe suer to be running VPN if you are accessing Rivanna from an off-grounds location.\n\n## Interactive Apps\n\nThese tools must be launched by specifying a set of parameters, including the allocation you are using. They are also timed and will close when time is up. Be sure to give yourself enough time when launching these, and to be aware of how much time you have when working.\n\nNote also that you should allocate the fewest resources necessary to do the work you plan to do. This saves resources on the remote host, but also allows your app to launch more quickly. If you ask for an excessive amount of resources, you may wait a long time (e.g. hours) to have your app launched.\n\n**Desktop**. Access to a GUI desktop to the remote server. This provides a access to various applications on the server, including a web browser, a file explorer, and terminal windows.  Using this is not necessary if you can get by with the tools listed above.\n\nFind under \"Interactive Apps > Desktop\" in the menu.\n\n**VS Code**. Access to Visual Studio Code on the remote server. This is a fully functional instance of the IDE.\n\nFind under \"Interactive Apps > Code Server\" in the menu.\n\n**Jupyter**. Access to Jupyter Lab on the remote server. Find under \"Interactive Apps > Jupyter Lab\" in the menu.\n\n**RStudio**. Access to Jupyter Lab on the remote server.\n\nFind under \"Interactive Apps > RStudio Server\" in the menu.\n\n## For More Information\n\nUVA's [Research Computing Learning Portal](https://learning.rc.virginia.edu/)  provides resources for learning how to use Rivanna. Here are two slide decks that you may find useful:\n\n* [Introduction to Rivanna](https://learning.rc.virginia.edu/notes/rivanna-intro/)\n* [Using Rivanna from the Command Line](https://learning.rc.virginia.edu/notes/rivanna-command-line/)\n\n::: {.callout-note}\nSee [video](https://canvas.its.virginia.edu/courses/75059/modules/items/821826) on Canvas.\n:::"},"formats":{"html":{"execute":{"fig-width":7,"fig-height":5,"fig-format":"retina","fig-dpi":96,"df-print":"default","error":false,"eval":true,"cache":null,"freeze":false,"echo":true,"output":true,"warning":true,"include":true,"keep-md":false,"keep-ipynb":false,"ipynb":null,"enabled":null,"daemon":null,"daemon-restart":false,"debug":false,"ipynb-filters":[],"engine":"markdown"},"render":{"keep-tex":false,"keep-source":false,"keep-hidden":false,"prefer-html":false,"output-divs":true,"output-ext":"html","fig-align":"default","fig-pos":null,"fig-env":null,"code-fold":"none","code-overflow":"scroll","code-link":false,"code-line-numbers":false,"code-tools":false,"tbl-colwidths":"auto","merge-includes":true,"latex-auto-mk":true,"latex-auto-install":true,"latex-clean":true,"latex-max-runs":10,"latex-makeindex":"makeindex","latex-makeindex-opts":[],"latex-tlmgr-opts":[],"latex-input-paths":[],"latex-output-dir":null,"link-external-icon":true,"link-external-newwindow":true,"self-contained-math":false,"format-resources":[]},"pandoc":{"standalone":true,"wrap":"none","default-image-extension":"png","to":"html","toc":true,"number-sections":false,"output-file":"rivanna.html"},"language":{},"metadata":{"lang":"en","fig-responsive":true,"quarto-version":"1.2.262","bibliography":["../refs.bib"],"_quarto-vars":{"version":2,"course_num":"DS 5100","course_title":"Programming for Data Science","academic_term":"Fall 2023","cohort_type":"Online","course_code":"DS5100-2023-08-O","course_allocation":"msds_ds5100","canvas_url":"https://canvas.its.virginia.edu/courses/75059","github_url":"https://github.com/ontoligent/DS5100-2023-08-O","website_url":"https://ontoligent.github.io/DS5100-2023-08-O","survey_form_url":"https://forms.office.com/r/YWaFPXPKz8","request_form_url":"https://forms.office.com/r/7G65N5eppk"},"theme":"cosmo","fig-cap-location":"bottom","reader-mode":false},"extensions":{"book":{"multiFile":true}}}}}